Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetTypeEnum
The lap offset type.

Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetTypeEnum.OffsetWholeBar
Offset whole bar.

Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetTypeEnum.OffsetBarEnd
Offset bar end.